<h1 id="thrixty_howtouse">Benutzung</h1>
Dieses Plugin ist dazu gedacht den Thrixty-Player in Ihre Wordpress Seite einzubinden.<br>
Um den Player einzubinden, k&ouml;nnen Sie beliebig viele <a href="#thrixty_player">Player</a> und <a href="#thrixty_layouts">Layouts</a> anlegen und diese sp&auml;ter mit Hilfe unseres Einbindungstools in Ihre Website einf&uuml;gen.<br>
<br>
Wenn Sie einen Player einbinden m&ouml;chten welcher sein eigenes Set an Optionen hat, k&ouml;nnen Sie hierf&uuml;r einen <a href="#thrixty_player">Player</a> anlegen.<br>
Wenn Sie mehrere Player einbinden m&ouml;chten, welche sich die selben Optionen teilen, k&ouml;nnen Sie hierf&uuml;r ein <a href="#thrixty_layouts">Layout</a> anlegen.<br>
<br>
Dieses Plugin arbeitet mit Shortcodes, um diese in Ihre Seite einzubinden gibt es ein Einbindungstool, dies finden Sie in der Tool-Bar des Editors.

<h2 id="thrixty_player">Player</h2>
Ein Player besteht aus den <a href="#thrixty_options_paths">Pfadinformationen</a> f&uuml;r die File-Listen und allen weiteren <a href="thrixty_options">Optionen</a>.<br>
Durch das Verwenden von Playern k&ouml;nnen Sie einen Player in Ihre Seite einbinden dessen Einstellungen einzigartig sind.
<br>
Die erstellten Player k&ouml;nnen Sie <a href="?page=thrixty_all_players">hier</a> verwalten, um einen neuen Player hinzuzuf&uuml;gen klicken Sie bitte  <a href="?page=thrixty_edit_player">hier</a>.

<h2 id="thrixty_layouts">Layouts</h2>
Ein Layout besteht nur aus den <a href="thrixty_options">Optionen</a>(Exklusive Pfadinformationen).<br>
Wenn Sie das Layout in die Seite einbinden wollen, m&uuml;ssen Sie zus&auml;tzlich die Pfade f&uuml;r die File-Listen angeben (Dies passiert erst beim Einbinden des Shortcodes).<br>
Durch das Verwenden von Layouts k&ouml;nnen Sie beliebig viele Player mit den gleichen Einstellungen in ihre Website einbinden.<br>
Wenn Sie dann die Einstellungen des Layouts &auml;ndern, wirkt sich das auf alle Player aus, die dieses Layout verwenden.
<br>
Die erstellten Layouts k&ouml;nnen Sie <a href="?page=thrixty_all_layouts">hier</a> verwalten, um ein neues Layout hinzuzuf&uuml;gen klicken Sie bitte  <a href="?page=thrixty_edit_layout">hier</a>.

<h2>Player und Layouts einbinden</h2>
Um ihre bereits erstellten Player und Layouts einzubinden, k&ouml;nnen Sie unser Einbindungstool verwenden.<br>
Dieses Tool finden Sie in der Tool-Bar im Wordpress Editor.<br>
Beim Einbinden k&ouml;nnen Sie w&auml;hlen ob Sie ein Player oder ein Layout einbinden m&ouml;chten.<br>

<h2 id="thrixty_options">Optionen</h2>
Hier sehen Sie nochmal alle Optionen des Thrixty-Players in der &Uuml;bersicht.